In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_excel('p1.xlsx')
df

   ID     Name  Age     City Department  Salary  Experience
0   1     Amit   24    Delhi         IT   55000           2
1   2     Riya   29   Mumbai         HR   60000           4
2   3    Samar   32    Delhi    Finance   75000           6
3   4     Neha   27     Pune         IT   50000           1
4   5    David   45  Chennai    Finance   90000          10
5   6    Alice   22    Delhi         HR   45000           1
6   7      Bob   36   Mumbai         IT   70000           5
7   8  Charlie   30     Pune    Finance   80000           7

In [6]:
df[['Name', 'City']]

      Name     City
0     Amit    Delhi
1     Riya   Mumbai
2    Samar    Delhi
3     Neha     Pune
4    David  Chennai
5    Alice    Delhi
6      Bob   Mumbai
7  Charlie     Pune

In [8]:
df.loc[4,'Name']

'David'

In [9]:
df[df['ID'] == 4]

   ID  Name  Age  City Department  Salary  Experience
3   4  Neha   27  Pune         IT   50000           1

In [14]:
#df[df['Salary']>60000]

df.query("Salary > 60000")

   ID     Name  Age     City Department  Salary  Experience
2   3    Samar   32    Delhi    Finance   75000           6
4   5    David   45  Chennai    Finance   90000          10
6   7      Bob   36   Mumbai         IT   70000           5
7   8  Charlie   30     Pune    Finance   80000           7

In [16]:
df.query("City == 'Delhi' and Age > 25")

   ID   Name  Age   City Department  Salary  Experience
2   3  Samar   32  Delhi    Finance   75000           6

In [17]:
df.query("Department == 'IT' and Experience > 3")

   ID Name  Age    City Department  Salary  Experience
6   7  Bob   36  Mumbai         IT   70000           5

In [19]:
df.query("Department == 'HR' or Department == 'Finance'")

   ID     Name  Age     City Department  Salary  Experience
1   2     Riya   29   Mumbai         HR   60000           4
2   3    Samar   32    Delhi    Finance   75000           6
4   5    David   45  Chennai    Finance   90000          10
5   6    Alice   22    Delhi         HR   45000           1
7   8  Charlie   30     Pune    Finance   80000           7

In [21]:
df.query("25 < Age <= 40")

   ID     Name  Age    City Department  Salary  Experience
1   2     Riya   29  Mumbai         HR   60000           4
2   3    Samar   32   Delhi    Finance   75000           6
3   4     Neha   27    Pune         IT   50000           1
6   7      Bob   36  Mumbai         IT   70000           5
7   8  Charlie   30    Pune    Finance   80000           7

In [24]:
df.query("Experience >= 5")['Name']

2      Samar
4      David
6        Bob
7    Charlie
Name: Name, dtype: object

In [27]:
df.iloc[0:6]

   ID   Name  Age     City Department  Salary  Experience
0   1   Amit   24    Delhi         IT   55000           2
1   2   Riya   29   Mumbai         HR   60000           4
2   3  Samar   32    Delhi    Finance   75000           6
3   4   Neha   27     Pune         IT   50000           1
4   5  David   45  Chennai    Finance   90000          10
5   6  Alice   22    Delhi         HR   45000           1

In [28]:
df.iloc[0:6, [1,2,3]]

    Name  Age     City
0   Amit   24    Delhi
1   Riya   29   Mumbai
2  Samar   32    Delhi
3   Neha   27     Pune
4  David   45  Chennai
5  Alice   22    Delhi

In [29]:
df.at[0, 'Salary']

np.int64(55000)

In [30]:
df.iloc[3, 3]

'Pune'

In [31]:
df.query("City == 'Delhi' and Experience >=2 and Salary > 50000")

   ID   Name  Age   City Department  Salary  Experience
0   1   Amit   24  Delhi         IT   55000           2
2   3  Samar   32  Delhi    Finance   75000           6